info/reproduce.org
#+TITLE: Reproducing Analysis of {{{tool}}}
#+AUTHOR: Karl Gemayel
#+Date: August 28, 2020 
#+OPTIONS: toc:2 H:3 num:3

#+LATEX_HEADER_EXTRA:  \usepackage{mdframed}
#+LATEX_HEADER_EXTRA: \BeforeBeginEnvironment{minted}{\begin{mdframed}}
#+LATEX_HEADER_EXTRA: \AfterEndEnvironment{minted}{\end{mdframed}}
#+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}

# * Complete flow
# Download Assembly file
# Construct Taxonomy tree
# Download genome files by ancestor name
# Construct blast database

# Given: Query genome names and ancestor
# Download relevant genome files (from name, with access to assembly file)

# Run Query on ancestor

#+MACRO: tool StartLink

# #+SUBTITLE: The commands used to set up, reproduce, and graph results from the {{{tool}}} paper


* Introduction
This document serves as a step-by-step instruction manual on how to replicate results from the {{{tool}}} paper. We note that many of the experiments are time-consuming and/or resource hungry. Therefore, we also provide raw results (from which graphs can be generated) as well as pre-constructed databases for the clades mentioned in the {{{tool}}} paper.

* Downloading
To download, simply clone the git repository
#+begin_src bash
  git clone ...
#+end_src

* Installation
** {{{tool}}}
Once downloaded, binaries can be "installed" by running 
#+begin_src bash
  source config.sh    # sets up environment variables
  source install.sh   # creates binaries
#+end_src

The =config.sh= script loads environment variables (see script for details). These will help you navigate and run commands. It is essential that this is executed if you want to follow the steps listed below.

The =install.sh= script creates binary files for all =python= drivers. This makes them easy to execute. If preferred, drivers can be executed by calling the =python= interpreter directly. The methods of execution are then:
#+begin_src bash
$bin/NAME_OF_DRIVER_py.sh               # if using installed binaries
python $driverpython/NAME_OF_DRIVER.py  # if using python interpreter
#+end_src
where =$driverpython= is loaded by the =config.sh= script.

*** Loading Python Libraries
    Most of {{{tool}}} is built in Python. We use =conda= to manage package installations. Simply run
 #+begin_src bash
 conda env create -f install/startlink.yml --name startlink  # needs to be executed only once
 conda activate startlink                   # run whenever you start a new shell
 #+end_src
** External Tools
   {{{tool}}} and {{{tool}}}+ and their analysis rely on a handful of external tools. The following need to be installed:
   - GeneMarkS-2
     - Used for building {{{tool}}}+ predictions, and for analysis
     - Place installation in =$base/bin_external/gms2/=
     - Link: http://exon.gatech.edu/GeneMark/license_download.cgi
   - ClustalO:
     - Used for constructing multiple sequence alignments
     - Install and must be accessible from =$PATH=
     - Link: http://www.clustal.org/omega/#Download
     - Install via Anaconda: =conda install -c bioconda clustalo=
   - Diamond BLAST:
     - Used for generating target databases and finding orthologs
     - Install and must be accessible from =$PATH=
     - Link: https://github.com/bbuchfink/diamond
     - Install via Anaconda (recommended): =conda install -c bioconda diamond=
   - Prodigal:
     - Used for initial analysis of gene-start prediction status
     - Place installation in =$base/bin_external/prodigal/=
     - Link: https://github.com/hyattpd/Prodigal


* How to continue and tips on running experiments!
After installation, it is best to first try running the toy example shown at the end of this document. It goes through all the steps from generating a target database to running {{{tool}}}. Since this is still in beta version, it will also help narrow down where issues might come from. Running commands with =-l INFO= should give enough information about what is going on. For debugging information, run with =-l DEBUG=.

The setup is still in its beta version. {{{tool}}} is currently limited to a particular directory structure, with a fixed type of input (i.e. full genome, with a specific database construction, see below). This was done to facilitate development and reduce potential for errors. I am currently working on refactoring and allowing a more diverse set of inputs, and relaxing the constraints on database structure so that users can use a BLASTp or Diamond BLASTp database that they already have. This is still very much work in progress.

Note: {{{tool}}} requires significant computational power and time. You can reduce this by tuning the parallelization parameters found in =$config/parallelization_defaults.conf=. It is recommended that you make a copy of this file and store it in =$config=. {{{tool}}} current supports PBS and multi-threading.

If you are interested in reproducing the results from scratch, then follow the document as is. If you are interested in testing out {{{tool}}}, then we recommend you start by running /H. salinarum/ on the /Archaea/ database. Start by downloading the data for genomes with verified start (see [[sec:dl_verified]]). If you already have the /Archaea/ database downloaded, then move to [[sec:exp_hsalinarum]]. Otherwise, first construct the database using the instructions in [[sec:data]]. 
* Prebuilt databases and StartLink predictions
For convenience, we provide the StartLink(+) predictions and the DIAMOND databases used to generate them. These can be found at
LINK

* Downloading and installing
