sbsp/info/reproduce.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-22 Wed 13:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Reproducing Analysis of StartLink</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Karl Gemayel" />
</head>
<body>
<div id="content">
<h1 class="title">Reproducing Analysis of StartLink</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcbd686b">1. Introduction</a></li>
<li><a href="#orgbcdcbb4">2. Downloading</a></li>
<li><a href="#org1fb1850">3. Installation</a>
<ul>
<li><a href="#org9a32db4">3.1. StartLink</a></li>
<li><a href="#orgf3a4404">3.2. External Tools</a></li>
</ul>
</li>
<li><a href="#org20dc248">4. How to continue and tips on running experiments!</a></li>
<li><a href="#org7d5b1f6">5. Downloading and installing</a>
<ul>
<li><a href="#orgde9a550">5.1. Data</a></li>
</ul>
</li>
<li><a href="#org9906481">6. Code and data structure</a></li>
<li><a href="#org6720767">7. Setting up</a></li>
<li><a href="#org6136b46">8. Experiments</a>
<ul>
<li><a href="#org8173b15">8.1. Difference in 5&rsquo; predictions on Representative Genomes</a></li>
<li><a href="#org3832e3d">8.2. Theoretical view of Independence</a></li>
<li><a href="#org1e97bf0">8.3. Genomes with genes with verified starts</a></li>
<li><a href="#orgbe79136">8.4. Larger set of query genomes</a></li>
</ul>
</li>
<li><a href="#org229532a">9. Toy Example</a></li>
<li><a href="#orgfcaace7">10. Using existing databases</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgcbd686b" class="outline-2">
<h2 id="orgcbd686b"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This document serves as a step-by-step instruction manual on how to replicate results from the StartLink paper. We note that many of the experiments are time-consuming and/or resource hungry. Therefore, we also provide raw results (from which graphs can be generated) as well as pre-constructed databases for the clades mentioned in the StartLink paper.
</p>
</div>
</div>

<div id="outline-container-orgbcdcbb4" class="outline-2">
<h2 id="orgbcdcbb4"><span class="section-number-2">2</span> Downloading</h2>
<div class="outline-text-2" id="text-2">
<p>
To download, simply clone the git repository
</p>
<div class="org-src-container">
<pre class="src src-bash">git clone ...
</pre>
</div>
</div>
</div>

<div id="outline-container-org1fb1850" class="outline-2">
<h2 id="org1fb1850"><span class="section-number-2">3</span> Installation</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org9a32db4" class="outline-3">
<h3 id="org9a32db4"><span class="section-number-3">3.1</span> StartLink</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Once downloaded, binaries can be &ldquo;installed&rdquo; by running 
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #657b83; font-weight: bold;">source</span> config.sh    <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">sets up environment variables</span>
<span style="color: #657b83; font-weight: bold;">source</span> install.sh   <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">creates binaries</span>
</pre>
</div>

<p>
The <code>config.sh</code> script loads environment variables (see script for details). These will help you navigate and run commands. It is essential that this is executed if you want to follow the steps listed below.
</p>

<p>
The <code>install.sh</code> script creates binary files for all <code>python</code> drivers. This makes them easy to execute. If preferred, drivers can be executed by calling the <code>python</code> interpreter directly. The methods of execution are then:
</p>
<div class="org-src-container">
<pre class="src src-bash">$<span style="color: #268bd2;">bin</span>/NAME_OF_DRIVER_py.sh               <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">if using installed binaries</span>
python $<span style="color: #268bd2;">driverpython</span>/NAME_OF_DRIVER.py  <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">if using python interpreter</span>
</pre>
</div>
<p>
where <code>$driverpython</code> is loaded by the <code>config.sh</code> script.
</p>
</div>

<div id="outline-container-org2e2eaca" class="outline-4">
<h4 id="org2e2eaca"><span class="section-number-4">3.1.1</span> Loading Python Libraries</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
Most of StartLink is built in Python. We use <code>conda</code> to manage package installations. Simply run
</p>
<div class="org-src-container">
<pre class="src src-bash">conda env create -f install/biogem_sbsp.yml  <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">needs to be executed only once</span>
conda activate biogem_sbsp                   <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">run whenever you start a new shell</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf3a4404" class="outline-3">
<h3 id="orgf3a4404"><span class="section-number-3">3.2</span> External Tools</h3>
<div class="outline-text-3" id="text-3-2">
<p>
StartLink and StartLink+ and their analysis rely on a handful of external tools. The following need to be installed:
</p>
<ul class="org-ul">
<li>GeneMarkS-2
<ul class="org-ul">
<li>Used for building StartLink+ predictions, and for analysis</li>
<li>Place installation in <code>$base/bin_external/gms2/</code></li>
<li>Link: <a href="http://exon.gatech.edu/GeneMark/license_download.cgi">http://exon.gatech.edu/GeneMark/license_download.cgi</a></li>
</ul></li>
<li>ClustalO:
<ul class="org-ul">
<li>Used for constructing multiple sequence alignments</li>
<li>Install and must be accessible from <code>$PATH</code></li>
<li>Link: <a href="http://www.clustal.org/omega/#Download">http://www.clustal.org/omega/#Download</a></li>
<li>Install via Anaconda: <code>conda install -c bioconda clustalo</code></li>
</ul></li>
<li>Diamond BLAST:
<ul class="org-ul">
<li>Used for generating target databases and finding orthologs</li>
<li>Install and must be accessible from <code>$PATH</code></li>
<li>Link: <a href="https://github.com/bbuchfink/diamond">https://github.com/bbuchfink/diamond</a></li>
<li>Install via Anaconda (recommended): <code>conda install -c bioconda diamond</code></li>
</ul></li>
<li>Prodigal:
<ul class="org-ul">
<li>Used for initial analysis of gene-start prediction status</li>
<li>Place installation in <code>$base/bin_external/prodigal/</code></li>
<li>Link: <a href="https://github.com/hyattpd/Prodigal">https://github.com/hyattpd/Prodigal</a></li>
</ul></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-org20dc248" class="outline-2">
<h2 id="org20dc248"><span class="section-number-2">4</span> How to continue and tips on running experiments!</h2>
<div class="outline-text-2" id="text-4">
<p>
After installation, it is best to first try running the toy example shown at the end of this document. It goes through all the steps from generating a target database to running StartLink. Since this is still in beta version, it will also help narrow down where issues might come from. Running commands with <code>-l INFO</code> should give enough information about what is going on. For debugging information, run with <code>-l DEBUG</code>.
</p>

<p>
The setup is still in its beta version. StartLink is currently limited to a particular directory structure, with a fixed type of input (i.e. full genome, with a specific database construction, see below). This was done to facilitate development and reduce potential for errors. I am currently working on refactoring and allowing a more diverse set of inputs, and relaxing the constraints on database structure so that users can use a BLASTp or Diamond BLASTp database that they already have. This is still very much work in progress.
</p>

<p>
Note: StartLink requires significant computational power and time. You can reduce this by tuning the parallelization parameters found in <code>$config/parallelization_defaults.conf</code>. It is recommended that you make a copy of this file and store it in <code>$config</code>. StartLink current supports PBS and multi-threading.
</p>

<p>
If you are interested in reproducing the results from scratch, then follow the document as is. If you are interested in testing out StartLink, then we recommend you start by running <i>H. salinarum</i> on the <i>Archaea</i> database. Start by downloading the data for genomes with verified start (see <a href="#orgfa7218d">5.1.1</a>). If you already have the <i>Archaea</i> database downloaded, then move to <a href="#orgabcf6ed">10</a>. Otherwise, first construct the database using the instructions in <a href="#org6a53761">5.1</a>. 
</p>
</div>
</div>
<div id="outline-container-org7d5b1f6" class="outline-2">
<h2 id="org7d5b1f6"><span class="section-number-2">5</span> Downloading and installing</h2>
<div class="outline-text-2" id="text-5">
</div>
