info/reproduce.org
** Data
   <<sec:data>>
*Note: As previously mentioned the data used is on the order of hundreds of gigabytes. As such, if one is only interested in reproducibility, we provide pre-built databases (and even raw statistics from our existing runs).*

We provide the databases for /Enterobacterales/, /Actinobacteria/, /Archaea/, and /FCB group/, and the sequence and label files for the genomes with verified starts: /E. coli/, /H. salinarum/, /N. pharaonis/, /M. tuberculosis/, and /R. denitrificans/. We also provide the steps to create a database with for any ancestor using data that can be downloaded from NCBI's website.

*** "Downloading" data for verified genomes
    <<sec:dl_verified>>
    This data is already provided with this installation in =$data/../verified=. It should be copied or linked to the =$data= directory. The following command links it 
    #+begin_src bash
      awk -F "," '{if (NR > 1 && NF) print $1}' $lists/verified.list  | while read -r gcfid; do
        ln -sn $data/../verified/$gcfid $data/;
      done
    #+end_src

*** Downloading Assembly Summary File
    #+begin_src bash
      $bin/download_assembly_summary_py.sh --database refseq --pf-output $metadata/refseq_assembly_summary.txt
    #+end_src
*** Representative Genomes
    #+begin_src bash
      # These lists are provided for reproducibility, since NCBI frequently updates them.
      pf_refseq_arc=$lists/refseq_representative_archaea.list
      pf_refseq_bac=$lists/refseq_representative_bacteria.list
      pf_assembly_summary=$metadata/refseq_assembly_summary.txt

      $bin/download_genomes_from_list_py.sh --pf-genome-list $pf_refseq_arc --pf-assembly-summary $pf_assembly_summary -l INFO
      $bin/download_genomes_from_list_py.sh --pf-genome-list $pf_refseq_bac --pf-assembly-summary $pf_assembly_summary -l INFO
    #+end_src
*** Constructing Taxonomy Tree
    To easily download genomes by clade, we first construct a taxonomy tree form NCBI's taxonomy information.
    #+begin_src bash
      pd_work=$tmp/tree

      mkdir -p $pd_work

      $bin/download_taxonomy_dump_py.sh --pd-output $metadata/taxdump
      $bin/build_taxonomy_tree_py.sh --pf-nodes-dmp $metadata/taxdump/nodes.dmp --pf-names-dmp $metadata/taxdump/names.dmp --pf-tree $pd_work/tree.pkl
    #+end_src

*** Download sequence/label files for different clades, and create Blast databases 
    Now, we can download genomes from different clades. In the paper, 5 clades are referenced (4 of which are used for the large scale analysis). If you want to change which clade is downloaded, simply change the array =clades= in the below script. The names are defined by NCBI's =name_txt= variable in it's assembly summaries.
    #+begin_src bash

      function mk_path_friendly() {
        echo "$1" | tr " " "_" | tr [:upper:] [:lower:];
      }

      dbt=refseq     # database type
      pf_tree=$tmp/tree/tree.pkl
      pf_ass_sum_comb=$metadata/${dbt}_assembly_summary.txt

      # Modify this array based on which genome data you want (e.g. set as "Archaea" if you are only interested
      # in archaeal genomes, or add any valid name_txt id from the taxonomy tree).
      # Warning: This downloads all genomes under that clade (one per taxonomy ID)
      declare -a clades=("Enterobacterales" "Actinobacteria" "Alphaproteobacteria" "FCB group" "Archaea")

      # loop over clades; download data under each clade
      for cl in ${clades[@]}; do
        dn_cl=$(mk_path_friendly "$cl")
        $bin/download_genomes_for_clade_py.sh --pf-tree $pf_tree --pf-assembly-summary $pf_ass_sum_comb --clade-id $cl --clade-id-type "name_txt" --favor-assembly-level-order --genomes-per-taxid 1 --pf-output-list $lists/${dbt}_${dn_cl}.list
      done
    #+end_src

    Construct Diamond Blastp databases
    #+begin_src bash

      for cl in "${clades[@]}"; do
        dn_cl=$(mk_path_friendly "$cl")

        pd_work="$tmp/extract_sequences/${dn_cl}"
        mkdir -p $pd_work

        cd $pd_work

        pf_list=$lists/${dbt}_${dn_cl}.list
        pf_faa=$pd_work/${dbt}_${dn_cl}.faa
        pf_db=$db/${dbt}_${dn_cl}.dmnd

        # extract sequences
        $bin/extract_annotated_sequences_py.sh --pf-genome-list $pf_list --pf-output $pf_faa

        # build blast
        $bin/build_blast_db_py.sh --pf-sequences $pf_faa --pf-db $pf_db

        # clean up sequence file
        [[ -f $pf_faa ]] & rm $pf_faa
      done

      cd $base
    #+end_src
*** Download query genomes from list
    #+begin_src bash
      pf_query_large=$lists/selected_query.list
      pf_ass_sum_query_large=$metadata/assembly_summary_query_large.txt
      $bin/download_genomes_from_list_py.sh --pf-genome-list $pf_query_large --pf-assembly-summary $pf_ass_sum_query_large  -l INFO
    #+end_src


