sbsp/info/reproduce.html
<div id="outline-container-orgde9a550" class="outline-3">
<h3 id="orgde9a550"><span class="section-number-3">5.1</span> Data</h3>
<div class="outline-text-3" id="text-5-1">
<p>
<a id="org6a53761"></a>
<b>Note: As previously mentioned the data used is on the order of hundreds of gigabytes. As such, if one is only interested in reproducibility, we provide pre-built databases (and even raw statistics from our existing runs).</b>
</p>

<p>
We provide the databases for <i>Enterobacterales</i>, <i>Actinobacteria</i>, <i>Archaea</i>, and <i>FCB group</i>, and the sequence and label files for the genomes with verified starts: <i>E. coli</i>, <i>H. salinarum</i>, <i>N. pharaonis</i>, <i>M. tuberculosis</i>, and <i>R. denitrificans</i>. We also provide the steps to create a database with for any ancestor using data that can be downloaded from NCBI&rsquo;s website.
</p>
</div>

<div id="outline-container-org0f04568" class="outline-4">
<h4 id="org0f04568"><span class="section-number-4">5.1.1</span> &ldquo;Downloading&rdquo; data for verified genomes</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
<a id="orgfa7218d"></a>
This data is already provided with this installation in <code>$data/../verified</code>. It should be copied or linked to the <code>$data</code> directory. The following command links it 
</p>
<div class="org-src-container">
<pre class="src src-bash">awk -F <span style="color: #2aa198;">","</span> <span style="color: #2aa198;">'{if (NR &gt; 1 &amp;&amp; NF) print $1}'</span> $<span style="color: #268bd2;">lists</span>/verified.list  | <span style="color: #859900; font-weight: bold;">while </span><span style="color: #657b83; font-weight: bold;">read</span> -r gcfid; <span style="color: #859900; font-weight: bold;">do</span>
  ln -sn $<span style="color: #268bd2;">data</span>/../verified/$<span style="color: #268bd2;">gcfid</span> $<span style="color: #268bd2;">data</span>/;
<span style="color: #859900; font-weight: bold;">done</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge01670c" class="outline-4">
<h4 id="orge01670c"><span class="section-number-4">5.1.2</span> Downloading Assembly Summary File</h4>
<div class="outline-text-4" id="text-5-1-2">
<div class="org-src-container">
<pre class="src src-bash">$<span style="color: #268bd2;">bin</span>/download_assembly_summary_py.sh --database refseq --pf-output $<span style="color: #268bd2;">metadata</span>/refseq_assembly_summary.txt
</pre>
</div>
</div>
</div>
<div id="outline-container-org1df4d6c" class="outline-4">
<h4 id="org1df4d6c"><span class="section-number-4">5.1.3</span> Representative Genomes</h4>
<div class="outline-text-4" id="text-5-1-3">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">These lists are provided for reproducibility, since NCBI frequently updates them.</span>
<span style="color: #268bd2;">pf_refseq_arc</span>=$<span style="color: #268bd2;">lists</span>/refseq_representative_archaea.list
<span style="color: #268bd2;">pf_refseq_bac</span>=$<span style="color: #268bd2;">lists</span>/refseq_representative_bacteria.list
<span style="color: #268bd2;">pf_assembly_summary</span>=$<span style="color: #268bd2;">metadata</span>/refseq_assembly_summary.txt

$<span style="color: #268bd2;">bin</span>/download_genomes_from_list_py.sh --pf-genome-list $<span style="color: #268bd2;">pf_refseq_arc</span> --pf-assembly-summary $<span style="color: #268bd2;">pf_assembly_summary</span> -l INFO
$<span style="color: #268bd2;">bin</span>/download_genomes_from_list_py.sh --pf-genome-list $<span style="color: #268bd2;">pf_refseq_bac</span> --pf-assembly-summary $<span style="color: #268bd2;">pf_assembly_summary</span> -l INFO
</pre>
</div>
</div>
</div>
<div id="outline-container-org40f83ea" class="outline-4">
<h4 id="org40f83ea"><span class="section-number-4">5.1.4</span> Constructing Taxonomy Tree</h4>
<div class="outline-text-4" id="text-5-1-4">
<p>
To easily download genomes by clade, we first construct a taxonomy tree form NCBI&rsquo;s taxonomy information.
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #268bd2;">pd_work</span>=$<span style="color: #268bd2;">tmp</span>/tree

mkdir -p $<span style="color: #268bd2;">pd_work</span>

$<span style="color: #268bd2;">bin</span>/download_taxonomy_dump_py.sh --pd-output $<span style="color: #268bd2;">metadata</span>/taxdump
$<span style="color: #268bd2;">bin</span>/build_taxonomy_tree_py.sh --pf-nodes-dmp $<span style="color: #268bd2;">metadata</span>/taxdump/nodes.dmp --pf-names-dmp $<span style="color: #268bd2;">metadata</span>/taxdump/names.dmp --pf-tree $<span style="color: #268bd2;">pd_work</span>/tree.pkl
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcab646c" class="outline-4">
<h4 id="orgcab646c"><span class="section-number-4">5.1.5</span> Download sequence/label files for different clades, and create Blast databases</h4>
<div class="outline-text-4" id="text-5-1-5">
<p>
Now, we can download genomes from different clades. In the paper, 5 clades are referenced (4 of which are used for the large scale analysis). If you want to change which clade is downloaded, simply change the array <code>clades</code> in the below script. The names are defined by NCBI&rsquo;s <code>name_txt</code> variable in it&rsquo;s assembly summaries.
</p>
<div class="org-src-container">
<pre class="src src-bash">
<span style="color: #859900; font-weight: bold;">function</span> <span style="color: #268bd2;">mk_path_friendly</span>() {
  <span style="color: #657b83; font-weight: bold;">echo</span> <span style="color: #2aa198;">"$1"</span> | tr <span style="color: #2aa198;">" "</span> <span style="color: #2aa198;">"_"</span> | tr [:upper:] [:lower:];
}

<span style="color: #268bd2;">dbt</span>=refseq     <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">database type</span>
<span style="color: #268bd2;">pf_tree</span>=$<span style="color: #268bd2;">tmp</span>/tree/tree.pkl
<span style="color: #268bd2;">pf_ass_sum_comb</span>=$<span style="color: #268bd2;">metadata</span>/${<span style="color: #268bd2;">dbt</span>}_assembly_summary.txt

<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">Modify this array based on which genome data you want (e.g. set as "Archaea" if you are only interested</span>
<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">in archaeal genomes, or add any valid name_txt id from the taxonomy tree).</span>
<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">Warning: This downloads all genomes under that clade (one per taxonomy ID)</span>
<span style="color: #657b83; font-weight: bold;">declare</span> -a <span style="color: #268bd2;">clades</span>=(<span style="color: #2aa198;">"Enterobacterales"</span> <span style="color: #2aa198;">"Actinobacteria"</span> <span style="color: #2aa198;">"Alphaproteobacteria"</span> <span style="color: #2aa198;">"FCB group"</span> <span style="color: #2aa198;">"Archaea"</span>)

<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">loop over clades; download data under each clade</span>
<span style="color: #859900; font-weight: bold;">for</span> cl<span style="color: #859900; font-weight: bold;"> in</span> ${<span style="color: #268bd2;">clades</span>[@]}; <span style="color: #859900; font-weight: bold;">do</span>
  <span style="color: #268bd2;">dn_cl</span>=$(mk_path_friendly <span style="color: #2aa198;">"$cl"</span>)
  $<span style="color: #268bd2;">bin</span>/download_genomes_for_clade_py.sh --pf-tree $<span style="color: #268bd2;">pf_tree</span> --pf-assembly-summary $<span style="color: #268bd2;">pf_ass_sum_comb</span> --clade-id $<span style="color: #268bd2;">cl</span> --clade-id-type <span style="color: #2aa198;">"name_txt"</span> --favor-assembly-level-order --genomes-per-taxid 1 --pf-output-list $<span style="color: #268bd2;">lists</span>/${<span style="color: #268bd2;">dbt</span>}_${<span style="color: #268bd2;">dn_cl</span>}.list
<span style="color: #859900; font-weight: bold;">done</span>
</pre>
</div>

<p>
Construct Diamond Blastp databases
</p>
<div class="org-src-container">
<pre class="src src-bash">
<span style="color: #859900; font-weight: bold;">for</span> cl<span style="color: #859900; font-weight: bold;"> in</span> <span style="color: #2aa198;">"${clades[@]}"</span>; <span style="color: #859900; font-weight: bold;">do</span>
  <span style="color: #268bd2;">dn_cl</span>=$(mk_path_friendly <span style="color: #2aa198;">"$cl"</span>)

  <span style="color: #268bd2;">pd_work</span>=<span style="color: #2aa198;">"$tmp/extract_sequences/${dn_cl}"</span>
  mkdir -p $<span style="color: #268bd2;">pd_work</span>

  <span style="color: #657b83; font-weight: bold;">cd</span> $<span style="color: #268bd2;">pd_work</span>

  <span style="color: #268bd2;">pf_list</span>=$<span style="color: #268bd2;">lists</span>/${<span style="color: #268bd2;">dbt</span>}_${<span style="color: #268bd2;">dn_cl</span>}.list
  <span style="color: #268bd2;">pf_faa</span>=$<span style="color: #268bd2;">pd_work</span>/${<span style="color: #268bd2;">dbt</span>}_${<span style="color: #268bd2;">dn_cl</span>}.faa
  <span style="color: #268bd2;">pf_db</span>=$<span style="color: #268bd2;">db</span>/${<span style="color: #268bd2;">dbt</span>}_${<span style="color: #268bd2;">dn_cl</span>}.dmnd

  <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">extract sequences</span>
  $<span style="color: #268bd2;">bin</span>/extract_annotated_sequences_py.sh --pf-genome-list $<span style="color: #268bd2;">pf_list</span> --pf-output $<span style="color: #268bd2;">pf_faa</span>

  <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">build blast</span>
  $<span style="color: #268bd2;">bin</span>/build_blast_db_py.sh --pf-sequences $<span style="color: #268bd2;">pf_faa</span> --pf-db $<span style="color: #268bd2;">pf_db</span>

  <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">clean up sequence file</span>
  [[ -f $<span style="color: #268bd2;">pf_faa</span> ]] &amp; rm $<span style="color: #268bd2;">pf_faa</span>
<span style="color: #859900; font-weight: bold;">done</span>

<span style="color: #657b83; font-weight: bold;">cd</span> $<span style="color: #268bd2;">base</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd4f516c" class="outline-4">
<h4 id="orgd4f516c"><span class="section-number-4">5.1.6</span> Download query genomes from list</h4>
<div class="outline-text-4" id="text-5-1-6">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #268bd2;">pf_query_large</span>=$<span style="color: #268bd2;">lists</span>/selected_query.list
<span style="color: #268bd2;">pf_ass_sum_query_large</span>=$<span style="color: #268bd2;">metadata</span>/assembly_summary_query_large.txt
$<span style="color: #268bd2;">bin</span>/download_genomes_from_list_py.sh --pf-genome-list $<span style="color: #268bd2;">pf_query_large</span> --pf-assembly-summary $<span style="color: #268bd2;">pf_ass_sum_query_large</span>  -l INFO
</pre>
</div>
</div>
</div>
</div>
</div>
