info/reproduce.org
* Code and data structure

After installing {{{tool}}}, you will have the following structure:

#+begin_src dot :file dir.pdf :cmdline -Tpdf
   digraph{
     sbsp -> data;
     sbsp -> runs;
     sbsp -> lists;
     sbsp -> code;
     sbsp -> bin
   
     code -> python;
     code -> bash;
   
   
     data -> G1;
     data -> G2;
     data -> "...";
     data -> GN;

     G1 -> "sequence.fasta";
     G1 -> "ncbi.gff";
     G1 -> "verified.gff";

     python -> lib;
     python -> driver;
     }
#+end_src

#+RESULTS:
[[file:dir.pdf]]


The =bin= directory contains all executables related to {{{tool}}}, while the =bin_external= may contain external tools, such as GeneMarkS-2 or Prodigal. 

The =data= directory will contain raw genome files (sequence and annotation labels) downloaded from NCBI. In particular, upon initial download of the code, it should contain the genomic sequences for the genomes with experimentally verified gene-starts.

The =list= directory has files that contain different lists of genomes (for example, those with verified genes, those selected as NCBI query genomes, etc...)

Finally the =runs= directory will contain runs of different tools, such as {{{tool}}}, GeneMarkS-2, or Prodigal (as well as one for NCBI's =PGAP=). These will be placed in a subdirectory per genome, as shown below.

#+begin_src dot :file dir_runs.pdf :cmdline -Tpdf
  digraph {
    gms21 [label="gms2"]
    sbsp1 [label="sbsp"]
    prodigal1 [label="prodigal"]

    gms22 [label="gms2"]
    sbsp2 [label="sbsp"]
    prodigal2 [label="prodigal"]

  
  runs -> G1;
    runs -> G2;
    runs -> "...";
    runs -> GN;

    G1 -> gms21;
    G1 -> sbsp1;
    G1 -> prodigal1;
    G2 -> gms22;
    G2 -> sbsp2;
    G2 -> prodigal2;

  }
#+end_src

#+RESULTS:
[[file:dir_runs.pdf]]

* Setting up
Since much of the analysis is done by comparing {{{tool}}} to NCBI's PGAP, GeneMarkS-2, and/or Prodigal, we first need to run these tools and add the results to the run directory. The following script is capable of doing that (note, depending on which analysis you want to reproduce, you may not need to run the tools on all lists):

#+begin_src bash

  # Enable if you have PBS installed
  pbs_options=""
  #pbs_options="--pf-parallelization-options $config/parallelization_pbs_1.conf"

  function run_tools_on_archaea() {
    pf_list="$1"

    $bin/run_tool_on_genome_list_py.sh --tool gms2 --pf-genome-list $pf_list --type archaea -l INFO --pd-work $runs ${pbs_options}
    $bin/run_tool_on_genome_list_py.sh --tool prodigal --pf-genome-list $pf_list --type archaea -l INFO --pd-work $runs ${pbs_options}
  }

  function run_tools_on_bacteria() {
    pf_list="$1"

    $bin/run_tool_on_genome_list_py.sh --tool gms2 --pf-genome-list $pf_list --type bacteria -l INFO --pd-work $runs ${pbs_options}
    $bin/run_tool_on_genome_list_py.sh --tool prodigal --pf-genome-list $pf_list --type bacteria -l INFO --pd-work $runs ${pbs_options}
  }

  pf_rep_arc=$lists/refseq_representative_archaea.list
  pf_rep_bac=$lists/refseq_representative_bacteria.list

  pf_list_verified_arc=$lists/verified_archaea.list
  pf_list_verified_bac=$lists/verified_bacteria.list

  pf_list_qncbi_arc=$lists/qncbi_archaea.list
  pf_list_qncbi_bac=$lists/qncbi_bacteria.list


  # Representative genomes
  run_tools_on_archaea $pf_rep_arc
  run_tools_on_bacteria $pf_rep_bac

  # Verified genomes
  run_tools_on_archaea $pf_list_verified_arc
  run_tools_on_bacteria $pf_list_verified_bac

  # NCBI query genomes
  run_tools_on_archaea $pf_list_qncbi_arc
  run_tools_on_bacteria $pf_list_qncbi_bac
#+end_src


* Experiments
  Unless otherwise noted, these variables (when applicable) will have the following values
  #+begin_src bash

    pf_list_verified=$lists/verified.list  # verified genomes
    pf_list_qncbi=$lists/qncbi.list   # query genomes

    # database and configuration files
    pf_db_index=$db/index.csv  # database location files
    pf_sbsp_options=$config/sbsp_defaults.conf # sbsp config file
    pf_pbs_options=$config/parallelization_defaults.conf   # PBS config file

    # PBS options
    toggle_pbs="--pf-parallelization-options $pf_pbs_options"  # if PBS not installed, set this option to empty: ""
    sg=8   # number of genomes to run simutaneously (low number recommended)
  #+end_src

** Difference in 5' predictions on Representative Genomes
*** Data download
    #+begin_src bash
      pf_rep_bac=$lists/refseq_representative_bacteria.list
      pf_rep_arc=$lists/refseq_representative_archaea.list
      pf_assembly_bac=$metadata/assembly_summary.txt
      # $bin/download_from_ncbi_py.sh --pf-assembly-summary $pf_assembly_bac --pf-data $data --pf-output-list

      # link ncbi as "tool" (for easy comparison wwith other tools)
      cat $pf_rep_bac $pf_rep_arc | grep -v gcfid | cut -f1 -d, | while read -r line; do
        mkdir -p $runs/$line; mkdir -p $runs/$line/ncbi;
        ln -s $data/$line/ncbi.gff $runs/$line/ncbi/ncbi.gff ;
      done
    #+end_src

*** Collect statistics
    We can now collect the statistics and create the figures to compare GMS2, Prodigal, and NCBI predictions.
    #+begin_src bash

      pd_work=$tmp/stats_refseq_vs_tools
      mkdir -p $pd_work
      cd $pd_work

      pf_stats=$pd_work/stats_tools.csv

      $bin/stats_tools_5prime_py.sh --pf-genome-lists $pf_rep_bac $pf_rep_arc --list-names Bacteria Archaea --dn-tools gms2 prodigal ncbi --tool-names GMS2 Prodigal NCBI --pf-output $pf_stats

      # create figures
      $bin/viz_stats_tools_5prime_py.sh --pf-stats $pf_stats

      cd $base
    #+end_src    

    This should now create a file containing the following image
    [[file:tools_5prime.pdf]]

