sbsp/info/reproduce.html


<div id="outline-container-org9906481" class="outline-2">
<h2 id="org9906481"><span class="section-number-2">6</span> Code and data structure</h2>
<div class="outline-text-2" id="text-6">
<p>
After installing StartLink, you will have the following structure:
</p>

<p>
<a href="dir.pdf">dir.pdf</a>
</p>


<p>
The <code>bin</code> directory contains all executables related to StartLink, while the <code>bin_external</code> may contain external tools, such as GeneMarkS-2 or Prodigal. 
</p>

<p>
The <code>data</code> directory will contain raw genome files (sequence and annotation labels) downloaded from NCBI. In particular, upon initial download of the code, it should contain the genomic sequences for the genomes with experimentally verified gene-starts.
</p>

<p>
The <code>list</code> directory has files that contain different lists of genomes (for example, those with verified genes, those selected as NCBI query genomes, etc&#x2026;)
</p>

<p>
Finally the <code>runs</code> directory will contain runs of different tools, such as StartLink, GeneMarkS-2, or Prodigal (as well as one for NCBI&rsquo;s <code>PGAP</code>). These will be placed in a subdirectory per genome, as shown below.
</p>

<p>
<a href="dir_runs.pdf">dir_runs.pdf</a>
</p>
</div>
</div>

<div id="outline-container-org6720767" class="outline-2">
<h2 id="org6720767"><span class="section-number-2">7</span> Setting up</h2>
<div class="outline-text-2" id="text-7">
<p>
Since much of the analysis is done by comparing StartLink to NCBI&rsquo;s PGAP, GeneMarkS-2, and/or Prodigal, we first need to run these tools and add the results to the run directory. The following script is capable of doing that (note, depending on which analysis you want to reproduce, you may not need to run the tools on all lists):
</p>

<div class="org-src-container">
<pre class="src src-bash">
<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">Enable if you have PBS installed</span>
<span style="color: #268bd2;">pbs_options</span>=<span style="color: #2aa198;">""</span>
<span style="color: #93a1a1;">#</span><span style="color: #93a1a1;">pbs_options="--pf-parallelization-options $config/parallelization_pbs_1.conf"</span>

<span style="color: #859900; font-weight: bold;">function</span> <span style="color: #268bd2;">run_tools_on_archaea</span>() {
  <span style="color: #268bd2;">pf_list</span>=<span style="color: #2aa198;">"$1"</span>

  $<span style="color: #268bd2;">bin</span>/run_tool_on_genome_list_py.sh --tool gms2 --pf-genome-list $<span style="color: #268bd2;">pf_list</span> --type archaea -l INFO --pd-work $<span style="color: #268bd2;">runs</span> ${<span style="color: #268bd2;">pbs_options</span>}
  $<span style="color: #268bd2;">bin</span>/run_tool_on_genome_list_py.sh --tool prodigal --pf-genome-list $<span style="color: #268bd2;">pf_list</span> --type archaea -l INFO --pd-work $<span style="color: #268bd2;">runs</span> ${<span style="color: #268bd2;">pbs_options</span>}
}

<span style="color: #859900; font-weight: bold;">function</span> <span style="color: #268bd2;">run_tools_on_bacteria</span>() {
  <span style="color: #268bd2;">pf_list</span>=<span style="color: #2aa198;">"$1"</span>

  $<span style="color: #268bd2;">bin</span>/run_tool_on_genome_list_py.sh --tool gms2 --pf-genome-list $<span style="color: #268bd2;">pf_list</span> --type bacteria -l INFO --pd-work $<span style="color: #268bd2;">runs</span> ${<span style="color: #268bd2;">pbs_options</span>}
  $<span style="color: #268bd2;">bin</span>/run_tool_on_genome_list_py.sh --tool prodigal --pf-genome-list $<span style="color: #268bd2;">pf_list</span> --type bacteria -l INFO --pd-work $<span style="color: #268bd2;">runs</span> ${<span style="color: #268bd2;">pbs_options</span>}
}

<span style="color: #268bd2;">pf_rep_arc</span>=$<span style="color: #268bd2;">lists</span>/refseq_representative_archaea.list
<span style="color: #268bd2;">pf_rep_bac</span>=$<span style="color: #268bd2;">lists</span>/refseq_representative_bacteria.list

<span style="color: #268bd2;">pf_list_verified_arc</span>=$<span style="color: #268bd2;">lists</span>/verified_archaea.list
<span style="color: #268bd2;">pf_list_verified_bac</span>=$<span style="color: #268bd2;">lists</span>/verified_bacteria.list

<span style="color: #268bd2;">pf_list_qncbi_arc</span>=$<span style="color: #268bd2;">lists</span>/qncbi_archaea.list
<span style="color: #268bd2;">pf_list_qncbi_bac</span>=$<span style="color: #268bd2;">lists</span>/qncbi_bacteria.list


<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">Representative genomes</span>
run_tools_on_archaea $<span style="color: #268bd2;">pf_rep_arc</span>
run_tools_on_bacteria $<span style="color: #268bd2;">pf_rep_bac</span>

<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">Verified genomes</span>
run_tools_on_archaea $<span style="color: #268bd2;">pf_list_verified_arc</span>
run_tools_on_bacteria $<span style="color: #268bd2;">pf_list_verified_bac</span>

<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">NCBI query genomes</span>
run_tools_on_archaea $<span style="color: #268bd2;">pf_list_qncbi_arc</span>
run_tools_on_bacteria $<span style="color: #268bd2;">pf_list_qncbi_bac</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org6136b46" class="outline-2">
<h2 id="org6136b46"><span class="section-number-2">8</span> Experiments</h2>
<div class="outline-text-2" id="text-8">
<p>
Unless otherwise noted, these variables (when applicable) will have the following values
</p>
<div class="org-src-container">
<pre class="src src-bash">
<span style="color: #268bd2;">pf_list_verified</span>=$<span style="color: #268bd2;">lists</span>/verified.list  <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">verified genomes</span>
<span style="color: #268bd2;">pf_list_qncbi</span>=$<span style="color: #268bd2;">lists</span>/qncbi.list   <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">query genomes</span>

<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">database and configuration files</span>
<span style="color: #268bd2;">pf_db_index</span>=$<span style="color: #268bd2;">db</span>/index.csv  <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">database location files</span>
<span style="color: #268bd2;">pf_sbsp_options</span>=$<span style="color: #268bd2;">config</span>/sbsp_defaults.conf <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">sbsp config file</span>
<span style="color: #268bd2;">pf_pbs_options</span>=$<span style="color: #268bd2;">config</span>/parallelization_defaults.conf   <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">PBS config file</span>

<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">PBS options</span>
<span style="color: #268bd2;">toggle_pbs</span>=<span style="color: #2aa198;">"--pf-parallelization-options $config/$pf_pbs_options"</span>  <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">if PBS not installed, set this option to empty: ""</span>
<span style="color: #268bd2;">sg</span>=8   <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">number of genomes to run simutaneously (low number recommended)</span>
</pre>
</div>
</div>
