info/reproduce.org
*** Visualizing
    All images regarding the large-scale comparisons can be generated via a single script. Note that the contour plots are computationally expensive and may take ~1 hour to generate. Therefore, they are turned off by default. To enable them, run the command with the option =--with-contours=. 
    #+begin_src bash
      cd $tmp/large_stats

      $bin/viz_stats_clade_level_py.sh --pf-data summary.csv 

      cd $base
    #+end_src

    #+CAPTION: The 5' error rate of NCBI compared to GMS2=SBSP for query genomes in different clades
    [[file:figures/sen_ncbi_gms2_eq_sbsp.pdf]]

    #+CAPTION: The 5' error rate of NCBI compared to GMS2=SBSP, as a function of genome GC
    [[file:figures/sen_ncbi_gms2_eq_sbsp_vs_gc.pdf]]

    #+CAPTION: Left: The sensitivity for each SBSP step on the set of verified genes (top), and the percentage (middle) and number (bottom) of SBSP genes predicted by step A alone, steps A and B, and all steps together. Right: Same analysis, for GMS2=SBSP. 
    [[file:figures/step_sen_cov_sbsp_and_sbsp_gms2_verified.pdf]]
    
    #+CAPTION: The 5' error rate of NCBI compared to GMS2=SBSP, shown per step of SBSP 
    [[file:figures/err_gms2_eq_sbsp_vs_ncbi_step.pdf]]

    #+CAPTION: The variation in proximity consistency as the distance to the upstream gene increases
    [[file:figures/pc_range.pdf]]

    #+CAPTION: The percentages of components whose most frequent upstream distance lies within the -10 and +10 \textit{nt} range. A component is defined as a single query and its targets
    [[file:figures/most_common_upstream.pdf]]

    #+CAPTION: The distribution of queries by minimum and maximum Kimura distance to their orthologs. This shows that most query genes in \textit{Enterobacterales} will find an orthologs that spread the range from 0.1 to 0.5 Kimura, whereas many in \textit{Actinobacteria} have a minimum Kimura distance of above 0.3 and even 0.4
    [[file:figures/kimura_kde.pdf]]

    #+CAPTION: The distribution of average Kimura distances (per component). The y-axis shows the percentage of queries (and thus, components) that have a particular average Kimura distance to its orthologs
    [[file:figures/kimura_avg.pdf]]

    #+CAPTION: The 5' sensitivity rate of NCBI compared to GMS2=SBSP (i.e. $Acc
\textrm{(NCBI, GMS2=SBSP)}$) based on the minimum and maximum Kimura distances between a query and its targets. The color bar measures the sensitivity rate, with brighter colors indicating higher sensitivity
    [[file:figures/sen_kimura_min_max.pdf]]

    #+CAPTION: Distribution of raw blast hits across clades for the set of query genomes in Table~\ref{tab:stats_ncbi}. Left: The raw number of BLAST hits per clade. Right: The cumulative percentage of queries with \textit{at most} $N$ BLASTp hits, where $N$ varies from 0 to 5,000. The shaded band shows the standard deviation (per clade) across query genomes
    [[file:figures/raw_blast_numbers.pdf]]    [[file:figures/raw_blast_percent.pdf]]

    #+CAPTION: The effect of changing the maximum Kimura threshold on SBSP's sensitivity and coverage rates. The minimum Kimura threshold is fixed to 0.1, and $x \in \{0.2, 0.3, ..., 0.8\}$
    [[file:figures/sen_cov_kimura_max.pdf]]

    #+CAPTION: The effect of changing the minimum Kimura threshold on SBSP's sensitivity and coverage rates. The maximum Kimura threshold is fixed to 0.5, and $x \in \{0.001, 0.1, 0.2, 0.3, 0.4\}$
    [[file:figures/sen_cov_kimura_min.pdf]]
    
    #+CAPTION: The performance of SBSP on small intervals of Kimura ranges: $[0.001, 0.1], [0.1, 0.2], [0.2, 0.3] \ldots [0.7, 0.8]$. The x-axis shows the mean Kimura of a block; e.g., for range $[a, b]$, the average is $(b+a)/2$
    [[file:figures/sen_cov_kimura_block.pdf]]

    #+CAPTION: Distribution of block conservation scores in regions around verified starts
    [[file:figures/score_blk_compare.pdf]]

    #+CAPTION: Distribution of 5' identity for verified starts, and upstream and downstream false 5' candidates
    [[file:figures/score_five_prime_compare.pdf]]

   



    

* Toy Example
  This section lists a set of commands to generate a toy database and and run H. salinarum predictions on it. 
  This is just meant for the user to test out whether the system has been installed correctly.

  Make sure you have GeneMarkS-2 installed under =$base/bin_external/gms2/=, and =Diamond= and =ClustalO= should be installed and in your path.

  #+begin_src bash

    # setup environment
    source config.sh
    source install.sh

    # download assembly summary files
    $bin/download_assembly_summary_py.sh --database refseq --pf-output $metadata/refseq_assembly_summary.txt

    # construct taxonomy tree
    pd_work=$tmp/tree
    mkdir -p $pd_work

    pf_tree=$pd_work/tree.pkl

    $bin/download_taxonomy_dump_py.sh --pd-output $metadata/taxdump
    $bin/build_taxonomy_tree_py.sh --pf-nodes-dmp $metadata/taxdump/nodes.dmp --pf-names-dmp $metadata/taxdump/names.dmp --pf-tree $pf_tree

    # download genomes for clade
    clade=Halobacterium
    dn_cl=halobacterium
    pf_assembly_summary=$metadata/refseq_assembly_summary.txt
    pf_t_list=$lists/refseq_${dn_cl}.list

    $bin/download_genomes_for_clade_py.sh --pf-tree $pf_tree --pf-assembly-summary $pf_assembly_summary --clade-id $clade --clade-id-type "name_txt" --favor-assembly-level-order --genomes-per-taxid 1 --pf-output-list $pf_t_list

    # extract labeled sequences for targets
    pd_work=$tmp/build_database/${dn_cl}

    pf_faa=$pd_work/refseq_${dn_cl}.faa
    pf_db=$db/refseq_${dn_cl}.dmnd
    pf_db_index=$db/index.csv      # database locations

    $bin/extract_annotated_sequences_py.sh --pf-genome-list $pf_t_list --pf-output $pf_faa

    # build database
    $bin/build_blast_db_py.sh --pf-sequences $pf_faa -pf-db $pf_db

    # add path to database into database index file
    echo -e "Clade,pf-db\n${clade},${pf_db}" > $pf_db_index

    [[ -f $pf_faa ]] & rm $pf_faa

    cd $base

    # run sbsp
    pf_sbsp_options=$config/sbsp_0.list
    $bin/sbsp_on_genome_list_py.sh --pf-q-list $lists/verified_hsalinarum.list --pd-work $runs --pf-sbsp-options $pf_sbsp_options --pf-db-index $pf_db_index

    # the prediction file 'sbsp.gff' will be located in the directory $runs/GENOME/sbsp/sbsp.gff
    # in this case GENOME is the id for H. salinarum, found in $lists/verified_hsalinarum.list

  #+end_src
  
