sbsp/info/reproduce.html
<div id="outline-container-org544f3da" class="outline-4">
<h4 id="org544f3da"><span class="section-number-4">8.4.2</span> Collecting statistics</h4>
<div class="outline-text-4" id="text-8-4-2">
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">collect statistics per query gene (comparing SBSP, GMS2, and verified genes)</span>
$<span style="color: #268bd2;">bin</span>/stats_per_query_gene_py.sh --pf-genome-list $<span style="color: #268bd2;">pf_list_qncbi</span> --pf-output-summary summary.csv
</pre>
</div>
</div>
</div>
<div id="outline-container-org7b10912" class="outline-4">
<h4 id="org7b10912"><span class="section-number-4">8.4.3</span> Visualizing</h4>
<div class="outline-text-4" id="text-8-4-3">
<p>
All images regarding the large-scale comparisons can be generated via a single script. Note that the contour plots are computationally expensive and may take ~1 hour to generate. Therefore, they are turned off by default. To enable them, run the command with the option <code>--with-contours</code>. 
</p>
<div class="org-src-container">
<pre class="src src-bash">$<span style="color: #268bd2;">bin</span>/viz_stats_clade_level_py.sh --pf-data summary.csv 
</pre>
</div>

<p>
<a href="figures/sen_ncbi_gms2_eq_sbsp.pdf">figures/sen_ncbi_gms2_eq_sbsp.pdf</a>
</p>

<p>
<a href="figures/sen_ncbi_gms2_eq_sbsp_vs_gc.pdf">figures/sen_ncbi_gms2_eq_sbsp_vs_gc.pdf</a>
</p>

<p>
<a href="figures/step_sen_cov_sbsp_and_sbsp_gms2_verified.pdf">figures/step_sen_cov_sbsp_and_sbsp_gms2_verified.pdf</a>
</p>

<p>
<a href="figures/err_gms2_eq_sbsp_vs_ncbi_step.pdf">figures/err_gms2_eq_sbsp_vs_ncbi_step.pdf</a>
</p>

<p>
<a href="figures/pc_range.pdf">figures/pc_range.pdf</a>
</p>

<p>
<a href="figures/most_common_upstream.pdf">figures/most_common_upstream.pdf</a>
</p>

<p>
<a href="figures/kimura_kde.pdf">figures/kimura_kde.pdf</a>
</p>

<p>
<a href="figures/kimura_avg.pdf">figures/kimura_avg.pdf</a>
</p>

<p>
\textrm{(NCBI, GMS2=SBSP)}$) based on the minimum and maximum Kimura distances between a query and its targets. The color bar measures the sensitivity rate, with brighter colors indicating higher sensitivity
    <a href="figures/sen_kimura_min_max.pdf">figures/sen_kimura_min_max.pdf</a>
</p>

<p>
<a href="figures/raw_blast_numbers.pdf">figures/raw_blast_numbers.pdf</a>    <a href="figures/raw_blast_percent.pdf">figures/raw_blast_percent.pdf</a>
</p>

<p>
<a href="figures/sen_cov_kimura_max.pdf">figures/sen_cov_kimura_max.pdf</a>
</p>

<p>
<a href="figures/sen_cov_kimura_min.pdf">figures/sen_cov_kimura_min.pdf</a>
</p>

<p>
<a href="figures/sen_cov_kimura_block.pdf">figures/sen_cov_kimura_block.pdf</a>
</p>

<p>
<a href="figures/score_blk_compare.pdf">figures/score_blk_compare.pdf</a>
</p>

<p>
<a href="figures/score_five_prime_compare.pdf">figures/score_five_prime_compare.pdf</a>
</p>
</div>
</div>
</div>
</div>







<div id="outline-container-org229532a" class="outline-2">
<h2 id="org229532a"><span class="section-number-2">9</span> Toy Example</h2>
<div class="outline-text-2" id="text-9">
<p>
This section lists a set of commands to generate a toy database and and run H. salinarum predictions on it. 
This is just meant for the user to test out whether the system has been installed correctly.
</p>

<p>
Make sure you have GeneMarkS-2 installed under <code>$base/bin_external/gms2/</code>, and <code>Diamond</code> and <code>ClustalO</code> should be installed and in your path.
</p>

<div class="org-src-container">
<pre class="src src-bash">
<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">setup environment</span>
<span style="color: #657b83; font-weight: bold;">source</span> config.sh
<span style="color: #657b83; font-weight: bold;">source</span> install.sh

<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">download assembly summary files</span>
$<span style="color: #268bd2;">bin</span>/download_assembly_summary_py.sh --database refseq --pf-output $<span style="color: #268bd2;">metadata</span>/refseq_assembly_summary.txt

<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">construct taxonomy tree</span>
<span style="color: #268bd2;">pd_work</span>=$<span style="color: #268bd2;">tmp</span>/tree
mkdir -p $<span style="color: #268bd2;">pd_work</span>

<span style="color: #268bd2;">pf_tree</span>=$<span style="color: #268bd2;">pd_work</span>/tree.pkl

$<span style="color: #268bd2;">bin</span>/download_taxonomy_dump_py.sh --pd-output $<span style="color: #268bd2;">metadata</span>/taxdump
$<span style="color: #268bd2;">bin</span>/build_taxonomy_tree_py.sh --pf-nodes-dmp $<span style="color: #268bd2;">metadata</span>/taxdump/nodes.dmp --pf-names-dmp $<span style="color: #268bd2;">metadata</span>/taxdump/names.dmp --pf-tree $<span style="color: #268bd2;">pf_tree</span>

<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">download genomes for clade</span>
<span style="color: #268bd2;">clade</span>=Halobacterium
<span style="color: #268bd2;">dn_cl</span>=halobacterium
<span style="color: #268bd2;">pf_assembly_summary</span>=$<span style="color: #268bd2;">metadata</span>/refseq_assembly_summary.txt
<span style="color: #268bd2;">pf_t_list</span>=$<span style="color: #268bd2;">lists</span>/refseq_${<span style="color: #268bd2;">dn_cl</span>}.list

$<span style="color: #268bd2;">bin</span>/download_genomes_for_clade_py.sh --pf-tree $<span style="color: #268bd2;">pf_tree</span> --pf-assembly-summary $<span style="color: #268bd2;">pf_assembly_summary</span> --clade-id $<span style="color: #268bd2;">clade</span> --clade-id-type <span style="color: #2aa198;">"name_txt"</span> --favor-assembly-level-order --genomes-per-taxid 1 --pf-output-list $<span style="color: #268bd2;">pf_t_list</span>

<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">extract labeled sequences for targets</span>
<span style="color: #268bd2;">pd_work</span>=$<span style="color: #268bd2;">tmp</span>/build_database/${<span style="color: #268bd2;">dn_cl</span>}

<span style="color: #268bd2;">pf_faa</span>=$<span style="color: #268bd2;">pd_work</span>/refseq_${<span style="color: #268bd2;">dn_cl</span>}.faa
<span style="color: #268bd2;">pf_db</span>=$<span style="color: #268bd2;">db</span>/refseq_${<span style="color: #268bd2;">dn_cl</span>}.dmnd
<span style="color: #268bd2;">pf_db_index</span>=$<span style="color: #268bd2;">db</span>/index.csv      <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">database locations</span>

$<span style="color: #268bd2;">bin</span>/extract_annotated_sequences_py.sh --pf-genome-list $<span style="color: #268bd2;">pf_t_list</span> --pf-output $<span style="color: #268bd2;">pf_faa</span>

<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">build database</span>
$<span style="color: #268bd2;">bin</span>/build_blast_db_py.sh --pf-sequences $<span style="color: #268bd2;">pf_faa</span> -pf-db $<span style="color: #268bd2;">pf_db</span>

<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">add path to database into database index file</span>
<span style="color: #657b83; font-weight: bold;">echo</span> -e <span style="color: #2aa198;">"Clade,pf-db\n${clade},${pf_db}"</span> &gt; $<span style="color: #268bd2;">pf_db_index</span>

[[ -f $<span style="color: #268bd2;">pf_faa</span> ]] &amp; rm $<span style="color: #268bd2;">pf_faa</span>

<span style="color: #657b83; font-weight: bold;">cd</span> $<span style="color: #268bd2;">base</span>

<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">run sbsp</span>
<span style="color: #268bd2;">pf_sbsp_options</span>=$<span style="color: #268bd2;">config</span>/sbsp_0.list
$<span style="color: #268bd2;">bin</span>/sbsp_on_genome_list_py.sh --pf-q-list $<span style="color: #268bd2;">lists</span>/verified_hsalinarum.list --pd-work $<span style="color: #268bd2;">runs</span> --pf-sbsp-options $<span style="color: #268bd2;">pf_sbsp_options</span> --pf-db-index $<span style="color: #268bd2;">pf_db_index</span>

<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">the prediction file 'sbsp.gff' will be located in the directory $runs/GENOME/sbsp/sbsp.gff</span>
<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">in this case GENOME is the id for H. salinarum, found in $lists/verified_hsalinarum.list</span>

</pre>
</div>
</div>
</div>
