info/reproduce.org
* Using existing databases
<<sec:exp_hsalinarum>>
As previously mentioned, all databases must be constructed using the =$bin/extract_annotated_sequences_py.sh= and =$bin/build_blast_db_py.sh= scripts. This is because, for now, the format of the database is strict. This will be relaxed in a later release.

We have provided some example databases. One containing all RefSeq annotated Archaea genomes, and another for RefSeq annotated Actinobacteria genomes. The below shows how to use them for SBSP prediction (example is shown for H. salinarum and Archaea):

#+begin_src bash

  # CHANGE THIS TO POINT TO DATABASE FILE. USE ABSOLUTE PATHS ONLY
  clade=Archaea
  pf_db=PATH-TO-DB.dmnd
  pf_db_index=$db/index.csv      # database locations

  # This file contains the list of query genomes. See existing examples in $lists for samples.
  # IMPORTANT: the genome and RefSeq labels must already be download and placed in
  # $data/GENOME_NAME/sequence.fasta and $data/GENOME_NAME/ncbi.gff
  pf_q_list=$lists/verified_hsalinarum.list

  # Path of database should be in index.
  echo -e "Clade,pf-db\n${clade},${pf_db}" > $pf_db_index

  # run sbsp (in this example, we're only running on verified genes (from verified.gff)). 
  # If --fn-q-labels is not provided, the program takes initial labels from ncbi.gff
  pf_sbsp_options=$config/sbsp_defaults.list
  $bin/sbsp_on_genome_list_py.sh --pf-q-list $lists/verified_hsalinarum.list --pd-work $runs --pf-sbsp-options $pf_sbsp_options --pf-db-index $pf_db_index --fn-q-labels verified.gff 

  # the prediction file 'sbsp.gff' will be located in the directory $runs/GENOME/sbsp/sbsp.gff
  # in this case GENOME is the id for GENOME_NAME, found in $pf_q_list
#+end_src

* COMMENT Running on verified genomes

SBSP takes as input:
- Query proteins: FASTA file
- Target protein database: Diamond database

It outputs:
- GFF file containing labels
- Multiple sequence alignment files for all queries
- details.csv: output file containing details of predictions



#+BEGIN_SRC bash
  # List of genomes with verified genes
  pf_list_verified=$lists/verified.list  # verified genomes
  pf_db_index=$db/index.csv  # database location files
  pf_sbsp_conf=$config/sbsp_defaults.conf # sbsp config file

  toggle_pbs="--pf-conf-pbs $config/pbs_defaults.conf"  # if PBS not installed, set this option to empty: ""
  sg=8   # number of genomes to run simutaneously (low number recommended)
  opt_verif="--fn-q-labels verified.gff --fn-q-labels-true verified.gff"

  $bin/sbsp_on_genome_list_py.sh --pf-q-list $pf_list_verified --simultaneous-genomes $sg --pd-work $pd_run --pf-sbsp-options $pf_sbsp_options  --pf-db-index $pf_db_index $opt_verif $toggle_pbs
#+END_SRC 

* COMMENT GMS2 on metagenomes
** Run GMS2 on genome fragments
#+begin_src bash :session
$bin/run_tools_on_genome_fragments_py.sh --pf-genome-list $lists/verified.list --tools gms2 prodigal
#+end_src
* COMMENT Collecting Data

* COMMENT Tables and Graphs
* COMMENT
* COMMENT Experiments

** Difference in 5' predictions on Representative Genomes
*** Data download
    #+begin_src bash
      pf_rep_bac=$lists/refseq_representative_bacteria.list
      pf_rep_arc=$lists/refseq_representative_archaea.list
      pf_assembly_bac=$metadata/assembly_summary.txt
      $bin/download_from_ncbi_py.sh --pf-assembly-summary $pf_assembly_bac --pf-data $data --pf-output-list

      # link ncbi as "tool" (for easy comparison wwith other tools)
      cat $pf_rep_bac $pf_rep_arc | grep -v gcfid | cut -f1 -d, | while read -r line; do
        mkdir -p $runs/$line; mkdir -p $runs/$line/ncbi;
        ln -s $data/$line/ncbi.gff $runs/$line/ncbi/ncbi.gff ;
      done
    #+end_src

*** Run GMS2 and Prodigal
    #+begin_src bash

      # Run on GMS2
      $bin/run_tool_on_genome_list_py.sh --tool gms2 --pf-genome-list $pf_rep_bac --type bacteria --dn-run gms2
      $bin/run_tool_on_genome_list_py.sh --tool gms2 --pf-genome-list $pf_rep_arc --type archaea --dn-run gms2

      # Run on Prodigal
      $bin/run_tool_on_genome_list_py.sh --tool prodigal --pf-genome-list $pf_rep_bac --type bacteria --dn-run prodigal
      $bin/run_tool_on_genome_list_py.sh --tool prodigal --pf-genome-list $pf_rep_arc --type archaea --dn-run prodigal
    #+end_src

*** Collect statistics
    We can now collect the statistics and create the figures to compare GMS2, Prodigal, and NCBI predictions.
    #+begin_src bash
      pf_stats=$pd_work/stats_tools.csv

      $bin/stats_tools_5prime_py.sh --pf-genome-lists $pf_rep_bac $pf_rep_arc --list-names Bacteria Archaea --dn-tools gms2 prodigal ncbi --tool-names GMS2 Prodigal NCBI --pf-output $pf_stats

      # create figures
      $bin/viz_stats_tools_5prime_py.sh --pf-stats $pf_stats
    #+end_src    

    This should now create a file containing the following image
    [[file:tools_5prime.pdf]]


** Sensitivity and coverage of GMS2 and SBSP on verified set
   Coverage and sensitivity tables
   Per Step (graph)
** NCBI Sensitivity compared to GMS2=SBSP
   Box plots
   As function of GC (scatter)
   Per Step
** Sensitivity for each SBSP Step on verified genes
** Proximity consistency
** Proximity of components with most frequent upstream distance distribution
** Kimura KDE
** Average Kimura
** Sensitivity by Kimura ranges
** RAW Blast results
   #+begin_src bash
     # get stats from log files 
   #+end_src

   


* COMMENT Experiments
** GMS2 vs NCBI vs Prodigal
** Sensitivity and coverage on verified set
*** Sensitivity and Coverage tables
*** Sensitivity per SBSP step
** NCBI vs GMS2=SBSP
*** Per GC
*** Per clade
*** 

    


