sbsp/info/reproduce.html

<div id="outline-container-orgfcaace7" class="outline-2">
<h2 id="orgfcaace7"><span class="section-number-2">10</span> Using existing databases</h2>
<div class="outline-text-2" id="text-10">
<p>
<a id="orgabcf6ed"></a>
As previously mentioned, all databases must be constructed using the <code>$bin/extract_annotated_sequences_py.sh</code> and <code>$bin/build_blast_db_py.sh</code> scripts. This is because, for now, the format of the database is strict. This will be relaxed in a later release.
</p>

<p>
We have provided some example databases. One containing all RefSeq annotated Archaea genomes, and another for RefSeq annotated Actinobacteria genomes. The below shows how to use them for SBSP prediction (example is shown for H. salinarum and Archaea):
</p>

<div class="org-src-container">
<pre class="src src-bash">
<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">CHANGE THIS TO POINT TO DATABASE FILE. USE ABSOLUTE PATHS ONLY</span>
<span style="color: #268bd2;">clade</span>=Archaea
<span style="color: #268bd2;">pf_db</span>=PATH-TO-DB.dmnd
<span style="color: #268bd2;">pf_db_index</span>=$<span style="color: #268bd2;">db</span>/index.csv      <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">database locations</span>

<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">This file contains the list of query genomes. See existing examples in $lists for samples.</span>
<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">IMPORTANT: the genome and RefSeq labels must already be download and placed in</span>
<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">$data/GENOME_NAME/sequence.fasta and $data/GENOME_NAME/ncbi.gff</span>
<span style="color: #268bd2;">pf_q_list</span>=$<span style="color: #268bd2;">lists</span>/verified_hsalinarum.list

<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">Path of database should be in index.</span>
<span style="color: #657b83; font-weight: bold;">echo</span> -e <span style="color: #2aa198;">"Clade,pf-db\n${clade},${pf_db}"</span> &gt; $<span style="color: #268bd2;">pf_db_index</span>

<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">run sbsp (in this example, we're only running on verified genes (from verified.gff)). </span>
<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">If --fn-q-labels is not provided, the program takes initial labels from ncbi.gff</span>
<span style="color: #268bd2;">pf_sbsp_options</span>=$<span style="color: #268bd2;">config</span>/sbsp_defaults.list
$<span style="color: #268bd2;">bin</span>/sbsp_on_genome_list_py.sh --pf-q-list $<span style="color: #268bd2;">lists</span>/verified_hsalinarum.list --pd-work $<span style="color: #268bd2;">runs</span> --pf-sbsp-options $<span style="color: #268bd2;">pf_sbsp_options</span> --pf-db-index $<span style="color: #268bd2;">pf_db_index</span> --fn-q-labels verified.gff 

<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">the prediction file 'sbsp.gff' will be located in the directory $runs/GENOME/sbsp/sbsp.gff</span>
<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">in this case GENOME is the id for GENOME_NAME, found in $pf_q_list</span>
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
